{
  "backend/main.mo": "Motoko canister defining core domain models and state for members, matches, Elo ratings, tournaments, photos, banners, schedules, and admin authorization, backed by Maps and blob storage. It implements the backend logic for player management, match approval, tournament state, and media handling.",
  "feature_evidence.json": "Feature evidence report documenting recent tournament score-entry UI improvements and dropdown usability fixes, including affected frontend files, dependencies, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten one-line summaries of frontend source files describing each component’s responsibility, used as reference documentation for build planning and feature verification.",
  "frontend/index.html": "Base HTML entry point that defines the root mount node and loads the React application via the main TypeScript module.",
  "frontend/src/App.tsx": "Top-level React application component managing authentication state, tab-based navigation, admin access logic, and conditional rendering of all major screens including Tournament and Admin areas.",
  "frontend/src/components/AdminBannerManager.tsx": "Admin-only UI for managing homepage banner photos, including uploading, deleting, and selecting images with validation, limits, progress tracking, and React Query integration.",
  "frontend/src/components/AdminManagement.tsx": "Administrative dashboard for managing members and permissions, including appointing score-auth admins, creating claimable members, updating photos, deleting members, and accessing banner management.",
  "frontend/src/components/AnnouncementBanner.tsx": "Fetches banner photo keys and photos, builds a rotating image banner with fade transitions, autoplay, and manual dot navigation. Shows a loader while fetching and hides itself if no banners exist.",
  "frontend/src/components/ClaimAccount.tsx": "Provides UI for authenticated users to claim a member account using a claim code, with success and error handling. Blocks unauthenticated users and users already registered as members with informational alerts.",
  "frontend/src/components/Footer.tsx": "Renders a static footer with copyright text, a heart icon, a link to caffeine.ai, and a Rotary table tennis emblem with tagline.",
  "frontend/src/components/Header.tsx": "Implements the main navigation header with authentication controls, responsive mobile menu, and role-based tabs. Dynamically shows tournament and admin links based on user roles and tournament state.",
  "frontend/src/components/Hero.tsx": "Displays the homepage hero section combining the announcement banner with a static hero image, gradient overlay, and introductory text.",
  "frontend/src/components/Leaderboard.tsx": "Displays global and category-based leaderboards using tabs, showing player rankings by Elo with icons, avatars, and explanatory alerts. Fetches leaderboard data and handles loading states.",
  "frontend/src/components/MatchHistory.tsx": "Shows authenticated users their approved match history with opponent names, scores, win/loss status, and rating changes. Prompts login if unauthenticated and filters matches to the current user.",
  "frontend/src/components/MatchHistoryScreen.tsx": "Displays a searchable and sortable table of all approved matches, combining match data with leaderboard info to resolve player names. Supports sorting by date, players, and score, with loading states and UI controls.",
  "frontend/src/components/MatchSubmission.tsx": "Provides an authenticated form for submitting a match result against another member, including opponent selection, score validation, and submission status handling. Opponents are grouped alphabetically for easier selection.",
  "frontend/src/components/MemberDirectory.tsx": "Renders a directory of members with avatars, ranks, ratings, and claimed status, optionally in preview mode. Fetches public member data and shows skeleton loaders while loading.",
  "frontend/src/components/PendingMatches.tsx": "Allows authenticated users, admins, or score admins to review pending match submissions and approve or reject them with reasons. Filters matches relevant to the current user and enforces permission checks.",
  "frontend/src/components/PhotoGallery.tsx": "Implements a photo gallery with static and user-uploaded images, supporting authenticated uploads, admin-controlled deletions, and upload progress feedback. Uses backend photo APIs and role-based access control.",
  "frontend/src/components/PlayerSummaryDashboard.tsx": "Renders a dashboard showing a selected player’s profile, ELO rating, match history, and performance stats, defaulting to the current user. It pulls leaderboard and match data, allows switching players, and computes ELO K-factor rules based on matches played.",
  "frontend/src/components/ProfileSetupModal.tsx": "Always-open modal prompting new users to enter and save their display name. Submits the profile via a mutation and blocks dismissal until completion.",
  "frontend/src/components/Tournament.tsx": "Main tournament management and viewing component with tabs for overview, scoring, approvals, and leaderboard. Handles tournament lifecycle actions (announce, start, pause, end, reset), registration, and admin-only controls.",
  "frontend/src/components/TournamentMatchApprovals.tsx": "Admin/score-authority interface for reviewing pending tournament matches and approving or rejecting them with optional rejection reasons. Aggregates pending matches from tournament state and updates results via mutations.",
  "frontend/src/components/TournamentScoreEntry.tsx": "Form for submitting tournament match scores, supporting both player and admin modes. Validates best-of-three scores and submits results for approval using tournament APIs.",
  "frontend/src/components/WeeklySchedule.tsx": "Displays and manages a weekly schedule of sessions, with optional preview mode. Admins can create, edit, and delete sessions using dialogs backed by schedule mutations.",
  "frontend/src/hooks/useActor.ts": "Provides a React hook that creates and caches a backend actor via react-query, returning an authenticated or anonymous actor based on Internet Identity. It recreates the actor when identity changes and invalidates/refetches dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider that manages authentication state, login/logout, and identity persistence using Dfinity AuthClient. Exposes a hook to access identity, login actions, and detailed login status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines a large set of react-query hooks for querying and mutating backend data (profiles, schedules, matches, tournaments, etc.) using the actor from useActor. Each hook handles enabling, mutations, and cache invalidation for its domain.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining design tokens via CSS variables for light/dark themes and base styles. Includes extensive custom styling and performance optimizations for Radix Select dropdown scrolling and scrollbars.",
  "frontend/src/main.tsx": "Application entry point that creates the React root and wraps the app with QueryClientProvider and InternetIdentityProvider. Imports global styles and renders the main App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from query strings or hash routing and persisting them in sessionStorage. Supports retrieving, storing, clearing, and sanitizing parameters without page reloads.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling class-based dark mode, scanning frontend sources, and extending the theme with CSS-variable-driven colors, radii, animations, and shadows. Registers typography, container queries, and animation plugins.",
  "project_state.json": "Defines the overall project snapshot for the FTTLR ICP dapp, including schema/version metadata, a high-level product summary, and a catalog of implemented features with IDs, descriptions, and versions. It serves as a canonical reference of current functionality across authentication, access control, member management, rankings, scheduling, media, and tournaments."
}